{
  "irVersion": "0.1.0",
  "docs": {},
  "services": [
    {
      "id": "s/graphql/0",
      "name": {},
      "docs": {},
      "groups": [
        {
          "name": {
            "source": "query",
            "canonical": "query"
          },
          "docs": {},
          "operations": [
            {
              "id": "op/graphql/query/secret",
              "name": {
                "source": "secret",
                "canonical": "secret"
              },
              "docs": {},
              "responses": [
                {
                  "name": {},
                  "conditions": {},
                  "payload": {
                    "contents": [
                      {
                        "type": {
                          "target": "t/graphql/types/Secret",
                          "nullable": true
                        }
                      }
                    ]
                  },
                  "docs": {}
                }
              ],
              "oneWay": false,
              "idempotency": {
                "kind": "safe"
              },
              "auth": null,
              "bindings": {
                "graphql": {
                  "kind": "query",
                  "fieldPath": [
                    "secret"
                  ]
                }
              },
              "provenance": {
                "source": 0,
                "pointer": "/query/secret"
              }
            }
          ]
        }
      ],
      "auth": null,
      "provenance": {
        "source": 0
      }
    }
  ],
  "types": {
    "t/graphql/types/Secret": {
      "kind": "model",
      "id": "t/graphql/types/Secret",
      "name": {
        "source": "Secret",
        "canonical": "secret"
      },
      "anonymous": false,
      "docs": {},
      "sensitive": false,
      "extensions": {
        "graphql:@auth": [
          {
            "role": "admin"
          }
        ]
      },
      "provenance": {
        "source": 0,
        "pointer": "/types/Secret"
      },
      "properties": [
        {
          "id": "p/graphql/types/Secret/fields/value",
          "name": {
            "source": "value",
            "canonical": "value"
          },
          "wireName": "value",
          "type": {
            "target": "t/prim/string",
            "nullable": false
          },
          "required": true,
          "clientOptional": false,
          "defaultAdded": false,
          "visibility": {
            "none": false
          },
          "flatten": false,
          "eventHeader": false,
          "eventPayload": false,
          "secret": false,
          "docs": {},
          "extensions": {
            "graphql:@auth": [
              {
                "role": "reader"
              },
              {
                "role": "writer"
              }
            ]
          },
          "provenance": {
            "source": 0,
            "pointer": "/types/Secret/fields/value"
          }
        }
      ],
      "abstract": false,
      "positional": false,
      "inputOnly": false
    },
    "t/prim/string": {
      "kind": "primitive",
      "id": "t/prim/string",
      "name": {},
      "anonymous": false,
      "docs": {},
      "sensitive": false,
      "provenance": {
        "source": 0
      },
      "prim": "string"
    }
  },
  "extensions": {
    "graphql:directive-definitions": [
      {
        "name": "auth",
        "repeatable": true,
        "locations": [
          "FIELD_DEFINITION",
          "OBJECT"
        ],
        "arguments": [
          {
            "name": "role",
            "type": "String!"
          }
        ]
      }
    ]
  },
  "sources": [
    {
      "format": "graphql@sdl",
      "path": "directives.graphql",
      "hash": "e941cd07011c0d15d165b25e83d4a81bf212b2157d8636aa367393a5823c303e"
    }
  ]
}
