{
  "irVersion": "0.1.0",
  "docs": {},
  "services": [
    {
      "id": "s/graphql/0",
      "name": {},
      "docs": {},
      "groups": [
        {
          "name": {
            "source": "query",
            "canonical": "query"
          },
          "docs": {},
          "operations": [
            {
              "id": "op/graphql/query/bestSeller",
              "name": {
                "source": "bestSeller",
                "canonical": "best_seller"
              },
              "docs": {},
              "responses": [
                {
                  "name": {},
                  "conditions": {},
                  "payload": {
                    "contents": [
                      {
                        "type": {
                          "target": "t/graphql/types/Product",
                          "nullable": true
                        }
                      }
                    ]
                  },
                  "docs": {}
                }
              ],
              "oneWay": false,
              "idempotency": {
                "kind": "safe"
              },
              "auth": null,
              "bindings": {
                "graphql": {
                  "kind": "query",
                  "fieldPath": [
                    "bestSeller"
                  ]
                }
              },
              "provenance": {
                "source": 0,
                "pointer": "/query/bestSeller"
              }
            }
          ]
        }
      ],
      "auth": null,
      "provenance": {
        "source": 0
      }
    }
  ],
  "types": {
    "t/graphql/scalars/ID": {
      "kind": "scalar",
      "id": "t/graphql/scalars/ID",
      "name": {
        "source": "ID",
        "canonical": "id"
      },
      "anonymous": false,
      "docs": {},
      "sensitive": false,
      "extensions": {
        "graphql:builtin-scalar": "ID"
      },
      "provenance": {
        "source": 0
      },
      "base": {
        "target": "t/prim/string",
        "nullable": false
      }
    },
    "t/graphql/types/Metrics": {
      "kind": "model",
      "id": "t/graphql/types/Metrics",
      "name": {
        "source": "Metrics",
        "canonical": "metrics"
      },
      "anonymous": false,
      "docs": {},
      "sensitive": false,
      "extensions": {
        "federation:@interfaceObject": [
          {}
        ],
        "federation:@key": [
          {
            "fields": "id"
          }
        ]
      },
      "provenance": {
        "source": 0,
        "pointer": "/types/Metrics"
      },
      "properties": [
        {
          "id": "p/graphql/types/Metrics/fields/id",
          "name": {
            "source": "id",
            "canonical": "id"
          },
          "wireName": "id",
          "type": {
            "target": "t/graphql/scalars/ID",
            "nullable": false
          },
          "required": true,
          "clientOptional": false,
          "defaultAdded": false,
          "visibility": {
            "none": false
          },
          "flatten": false,
          "eventHeader": false,
          "eventPayload": false,
          "secret": false,
          "docs": {},
          "provenance": {
            "source": 0,
            "pointer": "/types/Metrics/fields/id"
          }
        },
        {
          "id": "p/graphql/types/Metrics/fields/views",
          "name": {
            "source": "views",
            "canonical": "views"
          },
          "wireName": "views",
          "type": {
            "target": "t/prim/int32",
            "nullable": true
          },
          "required": false,
          "clientOptional": false,
          "defaultAdded": false,
          "visibility": {
            "none": false
          },
          "flatten": false,
          "eventHeader": false,
          "eventPayload": false,
          "secret": false,
          "docs": {},
          "provenance": {
            "source": 0,
            "pointer": "/types/Metrics/fields/views"
          }
        }
      ],
      "abstract": false,
      "positional": false,
      "inputOnly": false
    },
    "t/graphql/types/Product": {
      "kind": "model",
      "id": "t/graphql/types/Product",
      "name": {
        "source": "Product",
        "canonical": "product"
      },
      "anonymous": false,
      "docs": {},
      "sensitive": false,
      "extensions": {
        "federation:@key": [
          {
            "fields": "id"
          }
        ]
      },
      "provenance": {
        "source": 0,
        "pointer": "/types/Product"
      },
      "properties": [
        {
          "id": "p/graphql/types/Product/fields/id",
          "name": {
            "source": "id",
            "canonical": "id"
          },
          "wireName": "id",
          "type": {
            "target": "t/graphql/scalars/ID",
            "nullable": false
          },
          "required": true,
          "clientOptional": false,
          "defaultAdded": false,
          "visibility": {
            "none": false
          },
          "flatten": false,
          "eventHeader": false,
          "eventPayload": false,
          "secret": false,
          "docs": {},
          "provenance": {
            "source": 0,
            "pointer": "/types/Product/fields/id"
          }
        },
        {
          "id": "p/graphql/types/Product/fields/sku",
          "name": {
            "source": "sku",
            "canonical": "sku"
          },
          "wireName": "sku",
          "type": {
            "target": "t/prim/string",
            "nullable": false
          },
          "required": true,
          "clientOptional": false,
          "defaultAdded": false,
          "visibility": {
            "none": false
          },
          "flatten": false,
          "eventHeader": false,
          "eventPayload": false,
          "secret": false,
          "docs": {},
          "extensions": {
            "federation:@shareable": [
              {}
            ]
          },
          "provenance": {
            "source": 0,
            "pointer": "/types/Product/fields/sku"
          }
        },
        {
          "id": "p/graphql/types/Product/fields/internalName",
          "name": {
            "source": "internalName",
            "canonical": "internal_name"
          },
          "wireName": "internalName",
          "type": {
            "target": "t/prim/string",
            "nullable": true
          },
          "required": false,
          "clientOptional": false,
          "defaultAdded": false,
          "visibility": {
            "none": true
          },
          "flatten": false,
          "eventHeader": false,
          "eventPayload": false,
          "secret": false,
          "docs": {},
          "extensions": {
            "federation:@inaccessible": [
              {}
            ]
          },
          "provenance": {
            "source": 0,
            "pointer": "/types/Product/fields/internalName"
          }
        },
        {
          "id": "p/graphql/types/Product/fields/price",
          "name": {
            "source": "price",
            "canonical": "price"
          },
          "wireName": "price",
          "type": {
            "target": "t/prim/int32",
            "nullable": true
          },
          "required": false,
          "clientOptional": false,
          "defaultAdded": false,
          "visibility": {
            "none": false
          },
          "flatten": false,
          "eventHeader": false,
          "eventPayload": false,
          "secret": false,
          "docs": {},
          "extensions": {
            "federation:@override": [
              {
                "from": "products-v1"
              }
            ]
          },
          "provenance": {
            "source": 0,
            "pointer": "/types/Product/fields/price"
          }
        }
      ],
      "abstract": false,
      "positional": false,
      "inputOnly": false
    },
    "t/prim/int32": {
      "kind": "primitive",
      "id": "t/prim/int32",
      "name": {},
      "anonymous": false,
      "docs": {},
      "sensitive": false,
      "provenance": {
        "source": 0
      },
      "prim": "int32"
    },
    "t/prim/string": {
      "kind": "primitive",
      "id": "t/prim/string",
      "name": {},
      "anonymous": false,
      "docs": {},
      "sensitive": false,
      "provenance": {
        "source": 0
      },
      "prim": "string"
    }
  },
  "extensions": {
    "federation:@link": [
      {
        "url": "https://specs.apollo.dev/federation/v2.5",
        "import": [
          "@key",
          "@shareable",
          "@inaccessible",
          "@override",
          "@interfaceObject",
          "@tag"
        ]
      }
    ],
    "federation:version": "2"
  },
  "sources": [
    {
      "format": "graphql@sdl",
      "path": "federation-v2.graphql",
      "hash": "3b082e86201f9296dd8348208b346ce7f43544fddad1925bbe2d3614ade569df"
    }
  ]
}
