{
  "irVersion": "0.1.0",
  "docs": {},
  "services": [
    {
      "id": "s/graphql/0",
      "name": {},
      "docs": {},
      "groups": [
        {
          "name": {
            "source": "query",
            "canonical": "query"
          },
          "docs": {},
          "operations": [
            {
              "id": "op/graphql/query/user",
              "name": {
                "source": "user",
                "canonical": "user"
              },
              "docs": {},
              "params": [
                {
                  "name": {
                    "source": "id",
                    "canonical": "id"
                  },
                  "type": {
                    "target": "t/graphql/scalars/ID",
                    "nullable": false
                  },
                  "required": true,
                  "docs": {}
                }
              ],
              "responses": [
                {
                  "name": {},
                  "conditions": {},
                  "payload": {
                    "contents": [
                      {
                        "type": {
                          "target": "t/graphql/types/User",
                          "nullable": true
                        }
                      }
                    ]
                  },
                  "docs": {}
                }
              ],
              "oneWay": false,
              "idempotency": {
                "kind": "safe"
              },
              "auth": null,
              "bindings": {
                "graphql": {
                  "kind": "query",
                  "fieldPath": [
                    "user"
                  ]
                }
              },
              "provenance": {
                "source": 0,
                "pointer": "/query/user"
              }
            }
          ]
        }
      ],
      "auth": null,
      "provenance": {
        "source": 0
      }
    }
  ],
  "types": {
    "t/graphql/scalars/ID": {
      "kind": "scalar",
      "id": "t/graphql/scalars/ID",
      "name": {
        "source": "ID",
        "canonical": "id"
      },
      "anonymous": false,
      "docs": {},
      "sensitive": false,
      "extensions": {
        "graphql:builtin-scalar": "ID"
      },
      "provenance": {
        "source": 0
      },
      "base": {
        "target": "t/prim/string",
        "nullable": false
      }
    },
    "t/graphql/types/Address": {
      "kind": "model",
      "id": "t/graphql/types/Address",
      "name": {
        "source": "Address",
        "canonical": "address"
      },
      "anonymous": false,
      "docs": {
        "description": "The address of a user."
      },
      "sensitive": false,
      "provenance": {
        "source": 0,
        "pointer": "/types/Address"
      },
      "properties": [
        {
          "id": "p/graphql/types/Address/fields/street",
          "name": {
            "source": "street",
            "canonical": "street"
          },
          "wireName": "street",
          "type": {
            "target": "t/prim/string",
            "nullable": false
          },
          "required": true,
          "clientOptional": false,
          "defaultAdded": false,
          "visibility": {
            "none": false
          },
          "flatten": false,
          "eventHeader": false,
          "eventPayload": false,
          "secret": false,
          "docs": {},
          "provenance": {
            "source": 0,
            "pointer": "/types/Address/fields/street"
          }
        },
        {
          "id": "p/graphql/types/Address/fields/city",
          "name": {
            "source": "city",
            "canonical": "city"
          },
          "wireName": "city",
          "type": {
            "target": "t/prim/string",
            "nullable": true
          },
          "required": false,
          "clientOptional": false,
          "defaultAdded": false,
          "visibility": {
            "none": false
          },
          "flatten": false,
          "eventHeader": false,
          "eventPayload": false,
          "secret": false,
          "docs": {},
          "provenance": {
            "source": 0,
            "pointer": "/types/Address/fields/city"
          }
        }
      ],
      "abstract": false,
      "positional": false,
      "inputOnly": false
    },
    "t/graphql/types/User": {
      "kind": "model",
      "id": "t/graphql/types/User",
      "name": {
        "source": "User",
        "canonical": "user"
      },
      "anonymous": false,
      "docs": {
        "description": "A registered user."
      },
      "sensitive": false,
      "provenance": {
        "source": 0,
        "pointer": "/types/User"
      },
      "properties": [
        {
          "id": "p/graphql/types/User/fields/id",
          "name": {
            "source": "id",
            "canonical": "id"
          },
          "wireName": "id",
          "type": {
            "target": "t/graphql/scalars/ID",
            "nullable": false
          },
          "required": true,
          "clientOptional": false,
          "defaultAdded": false,
          "visibility": {
            "none": false
          },
          "flatten": false,
          "eventHeader": false,
          "eventPayload": false,
          "secret": false,
          "docs": {},
          "provenance": {
            "source": 0,
            "pointer": "/types/User/fields/id"
          }
        },
        {
          "id": "p/graphql/types/User/fields/name",
          "name": {
            "source": "name",
            "canonical": "name"
          },
          "wireName": "name",
          "type": {
            "target": "t/prim/string",
            "nullable": false
          },
          "required": true,
          "clientOptional": false,
          "defaultAdded": false,
          "visibility": {
            "none": false
          },
          "flatten": false,
          "eventHeader": false,
          "eventPayload": false,
          "secret": false,
          "docs": {},
          "provenance": {
            "source": 0,
            "pointer": "/types/User/fields/name"
          }
        },
        {
          "id": "p/graphql/types/User/fields/address",
          "name": {
            "source": "address",
            "canonical": "address"
          },
          "wireName": "address",
          "type": {
            "target": "t/graphql/types/Address",
            "nullable": true
          },
          "required": false,
          "clientOptional": false,
          "defaultAdded": false,
          "visibility": {
            "none": false
          },
          "flatten": false,
          "eventHeader": false,
          "eventPayload": false,
          "secret": false,
          "docs": {},
          "provenance": {
            "source": 0,
            "pointer": "/types/User/fields/address"
          }
        }
      ],
      "abstract": false,
      "positional": false,
      "inputOnly": false
    },
    "t/prim/string": {
      "kind": "primitive",
      "id": "t/prim/string",
      "name": {},
      "anonymous": false,
      "docs": {},
      "sensitive": false,
      "provenance": {
        "source": 0
      },
      "prim": "string"
    }
  },
  "sources": [
    {
      "format": "graphql@sdl",
      "path": "object-types.graphql",
      "hash": "faccafe82690c3dcb5c29a0fecdceec38adaf69ca80ddd31ee75cc7e42883434"
    }
  ]
}
