{
  "irVersion": "0.1.0",
  "name": "AllOfMixins",
  "version": "1.0.0",
  "docs": {},
  "services": [
    {
      "id": "s/openapi/0",
      "name": {
        "source": "AllOfMixins",
        "canonical": "all_of_mixins"
      },
      "docs": {},
      "provenance": {
        "source": 0
      }
    }
  ],
  "types": {
    "t/openapi/components/schemas/A": {
      "kind": "model",
      "id": "t/openapi/components/schemas/A",
      "name": {
        "source": "A",
        "canonical": "a"
      },
      "anonymous": false,
      "docs": {},
      "sensitive": false,
      "provenance": {
        "source": 0,
        "pointer": "/components/schemas/A"
      },
      "properties": [
        {
          "id": "p/openapi/components/schemas/A/properties/a",
          "name": {
            "source": "a",
            "canonical": "a"
          },
          "wireName": "a",
          "type": {
            "target": "t/prim/string",
            "nullable": false
          },
          "required": false,
          "clientOptional": false,
          "defaultAdded": false,
          "visibility": {
            "none": false
          },
          "flatten": false,
          "eventHeader": false,
          "eventPayload": false,
          "secret": false,
          "docs": {},
          "provenance": {
            "source": 0,
            "pointer": "/components/schemas/A/properties/a"
          }
        }
      ],
      "abstract": false,
      "positional": false,
      "inputOnly": false
    },
    "t/openapi/components/schemas/B": {
      "kind": "model",
      "id": "t/openapi/components/schemas/B",
      "name": {
        "source": "B",
        "canonical": "b"
      },
      "anonymous": false,
      "docs": {},
      "sensitive": false,
      "provenance": {
        "source": 0,
        "pointer": "/components/schemas/B"
      },
      "properties": [
        {
          "id": "p/openapi/components/schemas/B/properties/b",
          "name": {
            "source": "b",
            "canonical": "b"
          },
          "wireName": "b",
          "type": {
            "target": "t/prim/string",
            "nullable": false
          },
          "required": false,
          "clientOptional": false,
          "defaultAdded": false,
          "visibility": {
            "none": false
          },
          "flatten": false,
          "eventHeader": false,
          "eventPayload": false,
          "secret": false,
          "docs": {},
          "provenance": {
            "source": 0,
            "pointer": "/components/schemas/B/properties/b"
          }
        }
      ],
      "abstract": false,
      "positional": false,
      "inputOnly": false
    },
    "t/openapi/components/schemas/C": {
      "kind": "model",
      "id": "t/openapi/components/schemas/C",
      "name": {
        "source": "C",
        "canonical": "c"
      },
      "anonymous": false,
      "docs": {},
      "sensitive": false,
      "provenance": {
        "source": 0,
        "pointer": "/components/schemas/C"
      },
      "mixins": [
        {
          "target": "t/openapi/components/schemas/A",
          "nullable": false
        },
        {
          "target": "t/openapi/components/schemas/B",
          "nullable": false
        }
      ],
      "abstract": false,
      "positional": false,
      "inputOnly": false
    },
    "t/prim/string": {
      "kind": "primitive",
      "id": "t/prim/string",
      "name": {},
      "anonymous": false,
      "docs": {},
      "sensitive": false,
      "provenance": {
        "source": 0
      },
      "prim": "string"
    }
  },
  "servers": [
    {
      "name": {},
      "urlTemplate": "/",
      "description": {}
    }
  ],
  "sources": [
    {
      "format": "openapi@3.1",
      "path": "allof-mixins.yaml",
      "hash": "0d9f9259f8123e5277db580b7535445c0a2102ee98e2c467c1795e8d2b69a73d"
    }
  ]
}
