{
  "irVersion": "0.1.0",
  "name": "AnyOfUntagged",
  "version": "1.0.0",
  "docs": {},
  "services": [
    {
      "id": "s/openapi/0",
      "name": {
        "source": "AnyOfUntagged",
        "canonical": "any_of_untagged"
      },
      "docs": {},
      "auth": null,
      "provenance": {
        "source": 0
      }
    }
  ],
  "types": {
    "t/openapi/components/schemas/StringOrNumber": {
      "kind": "union",
      "id": "t/openapi/components/schemas/StringOrNumber",
      "name": {
        "source": "StringOrNumber",
        "canonical": "string_or_number"
      },
      "anonymous": false,
      "docs": {},
      "sensitive": false,
      "provenance": {
        "source": 0,
        "pointer": "/components/schemas/StringOrNumber"
      },
      "variants": [
        {
          "name": {
            "hint": "variant_0"
          },
          "type": {
            "target": "t/prim/string",
            "nullable": false
          },
          "docs": {}
        },
        {
          "name": {
            "hint": "variant_1"
          },
          "type": {
            "target": "t/prim/integer",
            "nullable": false
          },
          "docs": {}
        }
      ],
      "exclusive": false,
      "wireTagged": false
    },
    "t/prim/integer": {
      "kind": "primitive",
      "id": "t/prim/integer",
      "name": {},
      "anonymous": false,
      "docs": {},
      "sensitive": false,
      "provenance": {
        "source": 0
      },
      "prim": "integer"
    },
    "t/prim/string": {
      "kind": "primitive",
      "id": "t/prim/string",
      "name": {},
      "anonymous": false,
      "docs": {},
      "sensitive": false,
      "provenance": {
        "source": 0
      },
      "prim": "string"
    }
  },
  "servers": [
    {
      "name": {},
      "urlTemplate": "/",
      "description": {},
      "auth": null
    }
  ],
  "sources": [
    {
      "format": "openapi@3.1",
      "path": "anyof-untagged.yaml",
      "hash": "159176eb67c5d6b5bae31d3bc4a34bea7bfe8c2829424fec04c34937b10e834b"
    }
  ]
}
