{
  "irVersion": "0.1.0",
  "name": "Callbacks",
  "version": "1.0.0",
  "docs": {},
  "services": [
    {
      "id": "s/openapi/0",
      "name": {
        "source": "Callbacks",
        "canonical": "callbacks"
      },
      "docs": {},
      "groups": [
        {
          "name": {
            "hint": "default"
          },
          "docs": {},
          "operations": [
            {
              "id": "op/openapi/paths/~1subscribe/post",
              "name": {
                "source": "subscribe",
                "canonical": "subscribe"
              },
              "docs": {},
              "responses": [
                {
                  "name": {},
                  "conditions": {
                    "statusCodes": [
                      {
                        "from": 200,
                        "to": 200
                      }
                    ]
                  },
                  "docs": {
                    "description": "ok"
                  }
                }
              ],
              "oneWay": false,
              "idempotency": {},
              "bindings": {
                "http": [
                  {
                    "method": "POST",
                    "uriTemplate": "/subscribe",
                    "sharedRoute": false,
                    "checksumRequired": false,
                    "isWebhook": false,
                    "callbacks": [
                      {
                        "expression": "{$request.body#/callbackUrl}",
                        "operations": [
                          "op/openapi/paths/~1subscribe/post/callbacks/onEvent/{$request.body#~1callbackUrl}/post"
                        ]
                      }
                    ]
                  }
                ]
              },
              "provenance": {
                "source": 0,
                "pointer": "/paths/~1subscribe/post"
              }
            },
            {
              "id": "op/openapi/paths/~1subscribe/post/callbacks/onEvent/{$request.body#~1callbackUrl}/post",
              "name": {
                "source": "onEvent",
                "canonical": "on_event"
              },
              "docs": {},
              "responses": [
                {
                  "name": {},
                  "conditions": {
                    "statusCodes": [
                      {
                        "from": 200,
                        "to": 200
                      }
                    ]
                  },
                  "docs": {
                    "description": "ok"
                  }
                }
              ],
              "oneWay": false,
              "idempotency": {},
              "bindings": {
                "http": [
                  {
                    "method": "POST",
                    "uriTemplate": "{$request.body#/callbackUrl}",
                    "sharedRoute": false,
                    "checksumRequired": false,
                    "isWebhook": false
                  }
                ]
              },
              "provenance": {
                "source": 0,
                "pointer": "/paths/~1subscribe/post/callbacks/onEvent/{$request.body#~1callbackUrl}/post"
              }
            }
          ]
        }
      ],
      "provenance": {
        "source": 0
      }
    }
  ],
  "servers": [
    {
      "name": {},
      "urlTemplate": "/",
      "description": {}
    }
  ],
  "sources": [
    {
      "format": "openapi@3.1",
      "path": "callbacks.yaml",
      "hash": "d8d2488e77b7f921dd60e133f70c926d72ab3c3c521ca11aea82511bc8731171"
    }
  ]
}
