{
  "irVersion": "0.1.0",
  "name": "Constraints",
  "version": "1.0.0",
  "docs": {},
  "services": [
    {
      "id": "s/openapi/0",
      "name": {
        "source": "Constraints",
        "canonical": "constraints"
      },
      "docs": {},
      "auth": null,
      "provenance": {
        "source": 0
      }
    }
  ],
  "types": {
    "t/openapi/components/schemas/S": {
      "kind": "model",
      "id": "t/openapi/components/schemas/S",
      "name": {
        "source": "S",
        "canonical": "s"
      },
      "anonymous": false,
      "docs": {},
      "sensitive": false,
      "provenance": {
        "source": 0,
        "pointer": "/components/schemas/S"
      },
      "properties": [
        {
          "id": "p/openapi/components/schemas/S/properties/ratio",
          "name": {
            "source": "ratio",
            "canonical": "ratio"
          },
          "wireName": "ratio",
          "type": {
            "target": "t/prim/number",
            "nullable": false
          },
          "required": false,
          "clientOptional": false,
          "defaultAdded": false,
          "visibility": {
            "none": false
          },
          "constraints": {
            "min": "0.30000000000000004",
            "max": "9007199254740993",
            "exclusiveMin": false,
            "exclusiveMax": false,
            "multipleOf": "0.1",
            "uniqueItems": false
          },
          "flatten": false,
          "eventHeader": false,
          "eventPayload": false,
          "secret": false,
          "docs": {},
          "provenance": {
            "source": 0,
            "pointer": "/components/schemas/S/properties/ratio"
          }
        }
      ],
      "abstract": false,
      "positional": false,
      "inputOnly": false
    },
    "t/prim/number": {
      "kind": "primitive",
      "id": "t/prim/number",
      "name": {},
      "anonymous": false,
      "docs": {},
      "sensitive": false,
      "provenance": {
        "source": 0
      },
      "prim": "number"
    }
  },
  "servers": [
    {
      "name": {},
      "urlTemplate": "/",
      "description": {},
      "auth": null
    }
  ],
  "sources": [
    {
      "format": "openapi@3.1",
      "path": "constraints.yaml",
      "hash": "cbc7bec41f139626fb96ef0977cb8906639e16487902d282c2cf271e88a4a034"
    }
  ]
}
