{
  "irVersion": "0.1.0",
  "name": "DocsSummaryDesc",
  "version": "1.0.0",
  "docs": {},
  "services": [
    {
      "id": "s/openapi/0",
      "name": {
        "source": "DocsSummaryDesc",
        "canonical": "docs_summary_desc"
      },
      "docs": {},
      "groups": [
        {
          "name": {
            "hint": "default"
          },
          "docs": {},
          "operations": [
            {
              "id": "op/openapi/paths/~1ping/get",
              "name": {
                "source": "ping",
                "canonical": "ping"
              },
              "docs": {
                "summary": "Ping the server",
                "description": "Returns pong"
              },
              "responses": [
                {
                  "name": {},
                  "conditions": {
                    "statusCodes": [
                      {
                        "from": 200,
                        "to": 200
                      }
                    ]
                  },
                  "docs": {
                    "description": "ok"
                  }
                }
              ],
              "oneWay": false,
              "idempotency": {},
              "auth": null,
              "bindings": {
                "http": [
                  {
                    "method": "GET",
                    "uriTemplate": "/ping",
                    "sharedRoute": false,
                    "checksumRequired": false,
                    "isWebhook": false
                  }
                ]
              },
              "provenance": {
                "source": 0,
                "pointer": "/paths/~1ping/get"
              }
            }
          ]
        }
      ],
      "auth": null,
      "provenance": {
        "source": 0
      }
    }
  ],
  "servers": [
    {
      "name": {},
      "urlTemplate": "/",
      "description": {},
      "auth": null
    }
  ],
  "sources": [
    {
      "format": "openapi@3.1",
      "path": "docs-summary-desc.yaml",
      "hash": "fff17a15225eda479e313d3b96c99ae6469ea65d591decf4aaf08be58cda4b39"
    }
  ]
}
