{
  "irVersion": "0.1.0",
  "name": "ExtensionsX",
  "version": "1.0.0",
  "docs": {},
  "services": [
    {
      "id": "s/openapi/0",
      "name": {
        "source": "ExtensionsX",
        "canonical": "extensions_x"
      },
      "docs": {},
      "provenance": {
        "source": 0
      }
    }
  ],
  "types": {
    "t/openapi/components/schemas/S": {
      "kind": "model",
      "id": "t/openapi/components/schemas/S",
      "name": {
        "source": "S",
        "canonical": "s"
      },
      "anonymous": false,
      "docs": {},
      "sensitive": false,
      "extensions": {
        "openapi:x-rate-limit": 100
      },
      "provenance": {
        "source": 0,
        "pointer": "/components/schemas/S"
      },
      "properties": [
        {
          "id": "p/openapi/components/schemas/S/properties/a",
          "name": {
            "source": "a",
            "canonical": "a"
          },
          "wireName": "a",
          "type": {
            "target": "t/prim/string",
            "nullable": false
          },
          "required": false,
          "clientOptional": false,
          "defaultAdded": false,
          "visibility": {
            "none": false
          },
          "flatten": false,
          "eventHeader": false,
          "eventPayload": false,
          "secret": false,
          "docs": {},
          "provenance": {
            "source": 0,
            "pointer": "/components/schemas/S/properties/a"
          }
        }
      ],
      "abstract": false,
      "positional": false,
      "inputOnly": false
    },
    "t/prim/string": {
      "kind": "primitive",
      "id": "t/prim/string",
      "name": {},
      "anonymous": false,
      "docs": {},
      "sensitive": false,
      "provenance": {
        "source": 0
      },
      "prim": "string"
    }
  },
  "servers": [
    {
      "name": {},
      "urlTemplate": "/",
      "description": {}
    }
  ],
  "sources": [
    {
      "format": "openapi@3.1",
      "path": "extensions-x.yaml",
      "hash": "6778d8fc9bddafa4ea2050fe8f44f7eaa24290a68a80c9a335158087f472003b"
    }
  ]
}
