{
  "irVersion": "0.1.0",
  "name": "HTTPBinding",
  "version": "1.0.0",
  "docs": {},
  "services": [
    {
      "id": "s/openapi/0",
      "name": {
        "source": "HTTPBinding",
        "canonical": "http_binding"
      },
      "docs": {},
      "groups": [
        {
          "name": {
            "hint": "default"
          },
          "docs": {},
          "operations": [
            {
              "id": "op/openapi/paths/~1items~1{id}/get",
              "name": {
                "source": "getItem",
                "canonical": "get_item"
              },
              "docs": {},
              "params": [
                {
                  "name": {
                    "source": "id",
                    "canonical": "id"
                  },
                  "type": {
                    "target": "t/prim/string",
                    "nullable": false
                  },
                  "required": true,
                  "docs": {}
                }
              ],
              "responses": [
                {
                  "name": {},
                  "conditions": {
                    "statusCodes": [
                      {
                        "from": 200,
                        "to": 200
                      }
                    ]
                  },
                  "docs": {
                    "description": "ok"
                  }
                }
              ],
              "oneWay": false,
              "idempotency": {},
              "bindings": {
                "http": [
                  {
                    "method": "GET",
                    "uriTemplate": "/items/{id}",
                    "sharedRoute": false,
                    "paramBindings": [
                      {
                        "param": "id",
                        "location": "path",
                        "wireName": "id",
                        "style": "simple",
                        "explode": false,
                        "allowReserved": false
                      }
                    ],
                    "checksumRequired": false,
                    "isWebhook": false
                  }
                ]
              },
              "provenance": {
                "source": 0,
                "pointer": "/paths/~1items~1{id}/get"
              }
            }
          ]
        }
      ],
      "provenance": {
        "source": 0
      }
    }
  ],
  "types": {
    "t/prim/string": {
      "kind": "primitive",
      "id": "t/prim/string",
      "name": {},
      "anonymous": false,
      "docs": {},
      "sensitive": false,
      "provenance": {
        "source": 0
      },
      "prim": "string"
    }
  },
  "servers": [
    {
      "name": {},
      "urlTemplate": "/",
      "description": {}
    }
  ],
  "sources": [
    {
      "format": "openapi@3.1",
      "path": "http-binding.yaml",
      "hash": "6f5649eaf9989662cf6720ee40ae32b9ca4a7b3a3ac1a232974f5f39fd053b77"
    }
  ]
}
