{
  "irVersion": "0.1.0",
  "name": "MultipartEncoding",
  "version": "1.0.0",
  "docs": {},
  "services": [
    {
      "id": "s/openapi/0",
      "name": {
        "source": "MultipartEncoding",
        "canonical": "multipart_encoding"
      },
      "docs": {},
      "groups": [
        {
          "name": {
            "hint": "default"
          },
          "docs": {},
          "operations": [
            {
              "id": "op/openapi/paths/~1upload/post",
              "name": {
                "source": "upload",
                "canonical": "upload"
              },
              "docs": {},
              "request": {
                "contents": [
                  {
                    "mediaType": "multipart/form-data",
                    "type": {
                      "target": "t/anon/paths/~1upload/post/requestBody/content/multipart~1form-data/schema",
                      "nullable": false
                    },
                    "encoding": {
                      "p/openapi/paths/~1upload/post/requestBody/content/multipart~1form-data/schema/properties/file": {
                        "contentTypes": [
                          "image/png"
                        ],
                        "multi": false,
                        "filename": true
                      },
                      "p/openapi/paths/~1upload/post/requestBody/content/multipart~1form-data/schema/properties/tags": {
                        "multi": true,
                        "filename": false
                      }
                    }
                  }
                ],
                "extensions": {
                  "openapi:required": false
                }
              },
              "responses": [
                {
                  "name": {},
                  "conditions": {
                    "statusCodes": [
                      {
                        "from": 200,
                        "to": 200
                      }
                    ]
                  },
                  "docs": {
                    "description": "ok"
                  }
                }
              ],
              "oneWay": false,
              "idempotency": {},
              "auth": null,
              "bindings": {
                "http": [
                  {
                    "method": "POST",
                    "uriTemplate": "/upload",
                    "sharedRoute": false,
                    "requestContentTypes": [
                      "multipart/form-data"
                    ],
                    "checksumRequired": false,
                    "isWebhook": false
                  }
                ]
              },
              "provenance": {
                "source": 0,
                "pointer": "/paths/~1upload/post"
              }
            }
          ]
        }
      ],
      "auth": null,
      "provenance": {
        "source": 0
      }
    }
  ],
  "types": {
    "t/anon/paths/~1upload/post/requestBody/content/multipart~1form-data/schema": {
      "kind": "model",
      "id": "t/anon/paths/~1upload/post/requestBody/content/multipart~1form-data/schema",
      "name": {
        "hint": "upload_request"
      },
      "anonymous": true,
      "docs": {},
      "sensitive": false,
      "provenance": {
        "source": 0,
        "pointer": "/paths/~1upload/post/requestBody/content/multipart~1form-data/schema"
      },
      "properties": [
        {
          "id": "p/openapi/paths/~1upload/post/requestBody/content/multipart~1form-data/schema/properties/file",
          "name": {
            "source": "file",
            "canonical": "file"
          },
          "wireName": "file",
          "type": {
            "target": "t/prim/bytes",
            "nullable": false
          },
          "required": false,
          "clientOptional": false,
          "defaultAdded": false,
          "visibility": {
            "none": false
          },
          "flatten": false,
          "eventHeader": false,
          "eventPayload": false,
          "secret": false,
          "docs": {},
          "provenance": {
            "source": 0,
            "pointer": "/paths/~1upload/post/requestBody/content/multipart~1form-data/schema/properties/file"
          }
        },
        {
          "id": "p/openapi/paths/~1upload/post/requestBody/content/multipart~1form-data/schema/properties/tags",
          "name": {
            "source": "tags",
            "canonical": "tags"
          },
          "wireName": "tags",
          "type": {
            "target": "t/anon/paths/~1upload/post/requestBody/content/multipart~1form-data/schema/properties/tags",
            "nullable": false
          },
          "required": false,
          "clientOptional": false,
          "defaultAdded": false,
          "visibility": {
            "none": false
          },
          "flatten": false,
          "eventHeader": false,
          "eventPayload": false,
          "secret": false,
          "docs": {},
          "provenance": {
            "source": 0,
            "pointer": "/paths/~1upload/post/requestBody/content/multipart~1form-data/schema/properties/tags"
          }
        }
      ],
      "abstract": false,
      "positional": false,
      "inputOnly": false
    },
    "t/anon/paths/~1upload/post/requestBody/content/multipart~1form-data/schema/properties/tags": {
      "kind": "list",
      "id": "t/anon/paths/~1upload/post/requestBody/content/multipart~1form-data/schema/properties/tags",
      "name": {
        "hint": "tags"
      },
      "anonymous": true,
      "docs": {},
      "sensitive": false,
      "provenance": {
        "source": 0,
        "pointer": "/paths/~1upload/post/requestBody/content/multipart~1form-data/schema/properties/tags"
      },
      "elem": {
        "target": "t/prim/string",
        "nullable": false
      }
    },
    "t/prim/bytes": {
      "kind": "primitive",
      "id": "t/prim/bytes",
      "name": {},
      "anonymous": false,
      "docs": {},
      "sensitive": false,
      "provenance": {
        "source": 0
      },
      "prim": "bytes"
    },
    "t/prim/string": {
      "kind": "primitive",
      "id": "t/prim/string",
      "name": {},
      "anonymous": false,
      "docs": {},
      "sensitive": false,
      "provenance": {
        "source": 0
      },
      "prim": "string"
    }
  },
  "servers": [
    {
      "name": {},
      "urlTemplate": "/",
      "description": {},
      "auth": null
    }
  ],
  "diagnostics": [
    {
      "severity": "info",
      "code": "openapi/degraded-construct",
      "message": "request body is not required; optionality preserved under extensions",
      "provenance": {
        "source": 0,
        "pointer": "/paths/~1upload/post/requestBody"
      }
    }
  ],
  "sources": [
    {
      "format": "openapi@3.1",
      "path": "multipart-encoding.yaml",
      "hash": "f9f55921238aa041b3d7c685a222280830466b4cd4ba1b5454183459c58d7302"
    }
  ]
}
