{
  "irVersion": "0.1.0",
  "name": "NamedTypes",
  "version": "1.0.0",
  "docs": {},
  "services": [
    {
      "id": "s/openapi/0",
      "name": {
        "source": "NamedTypes",
        "canonical": "named_types"
      },
      "docs": {},
      "provenance": {
        "source": 0
      }
    }
  ],
  "types": {
    "t/openapi/components/schemas/Address": {
      "kind": "model",
      "id": "t/openapi/components/schemas/Address",
      "name": {
        "source": "Address",
        "canonical": "address"
      },
      "anonymous": false,
      "docs": {},
      "sensitive": false,
      "provenance": {
        "source": 0,
        "pointer": "/components/schemas/Address"
      },
      "properties": [
        {
          "id": "p/openapi/components/schemas/Address/properties/city",
          "name": {
            "source": "city",
            "canonical": "city"
          },
          "wireName": "city",
          "type": {
            "target": "t/prim/string",
            "nullable": false
          },
          "required": false,
          "clientOptional": false,
          "defaultAdded": false,
          "visibility": {
            "none": false
          },
          "flatten": false,
          "eventHeader": false,
          "eventPayload": false,
          "secret": false,
          "docs": {},
          "provenance": {
            "source": 0,
            "pointer": "/components/schemas/Address/properties/city"
          }
        }
      ],
      "abstract": false,
      "positional": false,
      "inputOnly": false
    },
    "t/openapi/components/schemas/User": {
      "kind": "model",
      "id": "t/openapi/components/schemas/User",
      "name": {
        "source": "User",
        "canonical": "user"
      },
      "anonymous": false,
      "docs": {},
      "sensitive": false,
      "provenance": {
        "source": 0,
        "pointer": "/components/schemas/User"
      },
      "properties": [
        {
          "id": "p/openapi/components/schemas/User/properties/name",
          "name": {
            "source": "name",
            "canonical": "name"
          },
          "wireName": "name",
          "type": {
            "target": "t/prim/string",
            "nullable": false
          },
          "required": false,
          "clientOptional": false,
          "defaultAdded": false,
          "visibility": {
            "none": false
          },
          "flatten": false,
          "eventHeader": false,
          "eventPayload": false,
          "secret": false,
          "docs": {},
          "provenance": {
            "source": 0,
            "pointer": "/components/schemas/User/properties/name"
          }
        },
        {
          "id": "p/openapi/components/schemas/User/properties/address",
          "name": {
            "source": "address",
            "canonical": "address"
          },
          "wireName": "address",
          "type": {
            "target": "t/openapi/components/schemas/Address",
            "nullable": false
          },
          "required": false,
          "clientOptional": false,
          "defaultAdded": false,
          "visibility": {
            "none": false
          },
          "flatten": false,
          "eventHeader": false,
          "eventPayload": false,
          "secret": false,
          "docs": {},
          "provenance": {
            "source": 0,
            "pointer": "/components/schemas/User/properties/address"
          }
        }
      ],
      "abstract": false,
      "positional": false,
      "inputOnly": false
    },
    "t/prim/string": {
      "kind": "primitive",
      "id": "t/prim/string",
      "name": {},
      "anonymous": false,
      "docs": {},
      "sensitive": false,
      "provenance": {
        "source": 0
      },
      "prim": "string"
    }
  },
  "servers": [
    {
      "name": {},
      "urlTemplate": "/",
      "description": {}
    }
  ],
  "sources": [
    {
      "format": "openapi@3.1",
      "path": "named-types.yaml",
      "hash": "b5d808a8deb72132985879df43400e7e0851fd7547ffdc2ff5e0871e40293298"
    }
  ]
}
