{
  "irVersion": "0.1.0",
  "name": "ReadOnlyWriteOnly",
  "version": "1.0.0",
  "docs": {},
  "services": [
    {
      "id": "s/openapi/0",
      "name": {
        "source": "ReadOnlyWriteOnly",
        "canonical": "read_only_write_only"
      },
      "docs": {},
      "auth": null,
      "provenance": {
        "source": 0
      }
    }
  ],
  "types": {
    "t/openapi/components/schemas/S": {
      "kind": "model",
      "id": "t/openapi/components/schemas/S",
      "name": {
        "source": "S",
        "canonical": "s"
      },
      "anonymous": false,
      "docs": {},
      "sensitive": false,
      "provenance": {
        "source": 0,
        "pointer": "/components/schemas/S"
      },
      "properties": [
        {
          "id": "p/openapi/components/schemas/S/properties/r",
          "name": {
            "source": "r",
            "canonical": "r"
          },
          "wireName": "r",
          "type": {
            "target": "t/prim/string",
            "nullable": false
          },
          "required": false,
          "clientOptional": false,
          "defaultAdded": false,
          "visibility": {
            "only": [
              "read",
              "delete",
              "query"
            ],
            "none": false
          },
          "flatten": false,
          "eventHeader": false,
          "eventPayload": false,
          "secret": false,
          "docs": {},
          "provenance": {
            "source": 0,
            "pointer": "/components/schemas/S/properties/r"
          }
        },
        {
          "id": "p/openapi/components/schemas/S/properties/w",
          "name": {
            "source": "w",
            "canonical": "w"
          },
          "wireName": "w",
          "type": {
            "target": "t/prim/string",
            "nullable": false
          },
          "required": false,
          "clientOptional": false,
          "defaultAdded": false,
          "visibility": {
            "only": [
              "create",
              "update"
            ],
            "none": false
          },
          "flatten": false,
          "eventHeader": false,
          "eventPayload": false,
          "secret": false,
          "docs": {},
          "provenance": {
            "source": 0,
            "pointer": "/components/schemas/S/properties/w"
          }
        }
      ],
      "abstract": false,
      "positional": false,
      "inputOnly": false
    },
    "t/prim/string": {
      "kind": "primitive",
      "id": "t/prim/string",
      "name": {},
      "anonymous": false,
      "docs": {},
      "sensitive": false,
      "provenance": {
        "source": 0
      },
      "prim": "string"
    }
  },
  "servers": [
    {
      "name": {},
      "urlTemplate": "/",
      "description": {},
      "auth": null
    }
  ],
  "sources": [
    {
      "format": "openapi@3.1",
      "path": "readonly-writeonly.yaml",
      "hash": "71302621184a5bd28ede813e2357b1d682fa5cfc4c94d6a81aed315e7dfa5386"
    }
  ]
}
