{
  "irVersion": "0.1.0",
  "name": "ScalarFormat",
  "version": "1.0.0",
  "docs": {},
  "services": [
    {
      "id": "s/openapi/0",
      "name": {
        "source": "ScalarFormat",
        "canonical": "scalar_format"
      },
      "docs": {},
      "provenance": {
        "source": 0
      }
    }
  ],
  "types": {
    "t/anon/components/schemas/Holder/properties/color": {
      "kind": "scalar",
      "id": "t/anon/components/schemas/Holder/properties/color",
      "name": {
        "hint": "color"
      },
      "anonymous": true,
      "docs": {},
      "sensitive": false,
      "provenance": {
        "source": 0,
        "pointer": "/components/schemas/Holder/properties/color"
      },
      "base": {
        "target": "t/prim/string",
        "nullable": false
      },
      "encoding": {
        "name": "hex-color"
      }
    },
    "t/openapi/components/schemas/Holder": {
      "kind": "model",
      "id": "t/openapi/components/schemas/Holder",
      "name": {
        "source": "Holder",
        "canonical": "holder"
      },
      "anonymous": false,
      "docs": {},
      "sensitive": false,
      "provenance": {
        "source": 0,
        "pointer": "/components/schemas/Holder"
      },
      "properties": [
        {
          "id": "p/openapi/components/schemas/Holder/properties/color",
          "name": {
            "source": "color",
            "canonical": "color"
          },
          "wireName": "color",
          "type": {
            "target": "t/anon/components/schemas/Holder/properties/color",
            "nullable": false
          },
          "required": false,
          "clientOptional": false,
          "defaultAdded": false,
          "visibility": {
            "none": false
          },
          "flatten": false,
          "eventHeader": false,
          "eventPayload": false,
          "secret": false,
          "docs": {},
          "provenance": {
            "source": 0,
            "pointer": "/components/schemas/Holder/properties/color"
          }
        }
      ],
      "abstract": false,
      "positional": false,
      "inputOnly": false
    },
    "t/prim/string": {
      "kind": "primitive",
      "id": "t/prim/string",
      "name": {},
      "anonymous": false,
      "docs": {},
      "sensitive": false,
      "provenance": {
        "source": 0
      },
      "prim": "string"
    }
  },
  "servers": [
    {
      "name": {},
      "urlTemplate": "/",
      "description": {}
    }
  ],
  "sources": [
    {
      "format": "openapi@3.1",
      "path": "scalar-format.yaml",
      "hash": "91e3ea2c136a93c72d882d3edc72567f2976ea5477e7a1d9a1e8fcc9ae6714b4"
    }
  ]
}
